# buttons
class Buttons:
    update = {"1": {"Обновить": "update"}}


# keyboard
class Keyboard:
    main_menu = [["изменение данных профиля", "проверить якласс"]]


# text
class Text:
    start = f"Привет, этот бот создан для напоминания о работах на Яклассе." + \
                 f"Но для этого нам нужен логин и пароль от вашего Якласса." + \
                 f"Если вы согласны, то введите логин:"
    enter_password = "Хорошо, теперь введите пароль:"
    chek = "Хорошо, теперь проверим, подождите чуть-чуть......"
    error_jaklass = 'К сожалению вы ввели неправильный логин или пароль, давайте попробуеб ещё, введите логин:'
    return_text_jaklass = "К радости у вас нет работ."
    bad_news = "К сожалению у вас есть работы:"
    main_menu = f"Вы в главном меню, выбирите что-то из кнопок"
    login = "Введите логин:"
    error = "Извините, но такого варианта нет, выбирите что-то другое."
